[
    {
        "itemName": "SmartCam® 400 in 1 Sup Game Box Rechargeable Console/Led Screen/Retro Classic Gaming Console (Random Color)",
        "price": " 619.00",
        "status": "In stock.",
        "itemDescription": "Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it. Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen. Play Longer: 600mAh rechargeable lithium battery, support up to 3-4 hours of continuous game play 3.0 Inches TFT Color Screen: High definition display, precise images transmission without delaying. Mini Handheld Design: Compact size and lightweight, convenient for carrying. Relaxed yourself at anywhere anytime."
    },
    {
        "itemName": "SmartCam® video games 98800 in 1 handheld console with tv support through av connections, plug and play device- Multi color",
        "price": " 689.00",
        "status": "In stock.",
        "itemDescription": "98800 games in 1 Handheld Game console Multi Color Handle Grip with additional games Play on any TV with AV Inputs Exclusive USB functions No expensive game console and enjoy hours of fun gaming"
    },
    {
        "itemName": "PS4 1TB Slim Bundled with Spider-Man, GT Sport, Ratchet & Clank And PSN 3Month",
        "price": " 29990.00",
        "status": "In stock.",
        "itemDescription": "Play the greatest games and PS4 exclusive, take your adventures online with PS plus and Stream or download TV shows and movies from Netflix, PS store or wherever you get your favourite entertainment Hdr-enabled PS4 games burst into life with incredible colour and clarity on an HDR TV, delivering a more vibrant, realistic spectrum of colours Store your games, apps, screenshots and videos with 1TB model – slimmer and lighter than the original PS4 model and available in jet Black What's in the box: number of games -3, PSN voucher-1, HDMI cable, power cord and USB cable on each unit"
    },
    {
        "itemName": "Rewy 400 in 1 Sup Game Box Rechargable Console/Led Screen/Retro Classic Gaming Console (Random Color)",
        "price": " 649.00",
        "status": "In stock.",
        "itemDescription": "Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it. Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen. Play Longer: 600mAh rechargeable lithium battery, support up to 3-4 hours of continuous game play 3.0 Inches TFT Color Screen: High definition display, precise images transmission without delaying. Mini Handheld Design: Compact size and lightweight, convenient for carrying. Relaxed yourself at anywhere anytime."
    },
    {
        "itemName": "Mitashi Game In Smarty Pro 2.0 Handheld Gaming Console with 3000 In-built (Black)",
        "price": " 3808.00",
        "status": "In stock.",
        "itemDescription": "4.3 \"(10.9 cm) TFT LCD screen Built in 3000 Classic Games Download and Play Exciting 8/16/32 Bit Graphic Games 10.9cm (4.3) LCD Screen Watch Movies and Videos, Read E-Books, Clicks Pictures and Video Chat Can Connect to TV Inbuilt Lithium Rechargeable Battery"
    },
    {
        "itemName": "Mitashi GameIn Infrazone NX TV Gaming Console",
        "price": " 2170.00",
        "status": "In stock.",
        "itemDescription": "Wireless Gaming Console Supports 8 bit cartridges in the console 362 Built -In Games Main Chip IC: Dot IC type (VT03.9800-362G) Sencor PCB: BS-9800F-362G.PCB Adapter : 5.0V DC ~ 500mA Adapter wire length: 1.5 meter"
    },
    {
        "itemName": "SmartCam Two Players USB Wireless Handheld TV Video Game Console Build in 620 Classic Games 8Bit Mini Video Game Console Support AV Output for Kids (Off-White)",
        "price": " 1689.00",
        "status": "In stock.",
        "itemDescription": "IN THE BOX - 1 Gaming Console, 2 Controls, 1 AV Cable The Product is very sturdy and looks very stylish. Two player wireless video game with built in games. Plug & Play Video Game, *Type: Wireless TV Video Game It has amazing built-in Games to make it even more interesting."
    },
    {
        "itemName": "Careflection 4K HD TV video game Console built in 3000 Games PS1 Arcade Emulators game console Multiplayer wireless joystick Controller U8 3D game console Gift Video Game",
        "price": " 6599.00",
        "status": "In stock.",
        "itemDescription": "🎮 [Support HDMI output] Our video game controller can play wireless function and support USB charging within 10 meters. 🎮 [Plug and Play, no action required] No need to automatically install any drivers. Just plug the game console into the TV's USB port and use the TV. After setting the corresponding channel on the remote control, you can start playing the game! Very simple and easy to operate! 🎮 [Built-in 3000 non-repeating classic games] This black video game controller supports HDMI output. Solve the problem of repeated games in the first-generation game console without worrying about losing the game atmosphere due to repeated games. Support 9 emulators: arcade games, ps1, nes,snes, gb, gbc, gba, genesis, adari. 🎮 You can download those game files on Internet and copy them into your TF card and play on the console ✨ 🎮 Best for Gifting ideas for Birthday and any type of occasion ✨"
    },
    {
        "itemName": "MrDeal 620 Retro Classic Video Game Console AV Output Mini NES Console 620 in 1 Built-in Plug and Play Video Games with 2 Controllers Handheld Games for Kids & Adults (Small)",
        "price": " 1399.00",
        "status": "In stock.",
        "itemDescription": "【Rich Classic Game】 Built-in hundreds of games, Including dozens of the most NES classic video games, action, sports, puzzles, fighting and racing,and dozens more.Super Mario Bros,Spider-Man,Final Fantasy Can let you regain your childhood memories. 【TV Display】 Connect to your TV or Computer via AV Cable and play hundreds of games instantly. Let you can easily enjoy vivid and exciting video games in a big screen. It can also exercise children's thinking and logical ability. In the game clearance success, it also can bring the children full of confidence. 【Built In 620 Video Games】 This is a retro TV video game consoles of the 80s of the last century, it collected a lot of last century game. Built-in 620 retro video games 620 Classic Games recover your childrenhood memory. You can easily find 30-40 games that belong to your favorite classic game. 【Promote Parent-Child Comminucation】 retro game consoles let your children experience the experience and happiness of your growth, and promote your communication and feelings with your children.,Smooth games and familiar sounds will bring you the joy of childhood， hand feels comfortable, better share your fun with family and friends. 【Perfect gifts for kids and adult】 Great gift for kids and adults in Christmas, Birthday, enjoy the classic games easier, Take you go back to the childhood memories. This will be a great holiday gift, a birthday gift."
    },
    {
        "itemName": "Brand New World SUP Handheld Game Console, Classic Retro Video Gaming Player Colorful LCD Screen USB Rechargeable Portable Game Console with 400 in 1 Classic Old Games Best Toy Gift for Kids",
        "price": " 626.00",
        "status": "In stock.",
        "itemDescription": "Select a seller as \"chamunda enterprises\" Or cloudtail or sold and fulfilled buy chamunda enterprises or cloudtail then only you get warranty, if buy from other seller then no any warranty provided 400 retro classic games - The game console built-in 400 classic games such as Red fortress, contra, Tank Wars, tetris, etc. Taking you back to your happy childhood (Please note )product has 5 different color variety that is; Red, Black, Yellow, white and blue, so we ship Random color which is available in stock Easy to carry -- 3-inch color screen, the surface is made of leather, comfortable touch, small and easy to carry, convenient size and lightweight, perfect for playing travel or on the go Also connect to TV and play games, package contain 1 support game console only with accessory, Country of Origin: China"
    },
    {
        "itemName": "AmazonBasics Travel and Storage Case for Nintendo Switch - Red",
        "price": " 1899.00",
        "status": "In stock.",
        "itemDescription": "Travel and storage solution for Nintendo Switch—fits the Switch console and dock, cables (HDMI and AC adapter), Joy-con controllers, and Joy-con controller grip Foam-padding interior keeps equipment well protected during transport Durable hard shell provides ultimate protection; Red color Rubberized carry handle for comfortable portability 1 year limited warranty For customer service and warranty related queries please contact us: [1800-419-0416] (available Monday to Saturday from 9:30 AM to 6:00 PM except national holidays)"
    },
    {
        "itemName": "DIG PS2 Game Controller to PC USB Converter PlayStation 2 USB Controller Adapter PS2 To PC 2-Port Gaming Converter",
        "price": " 399.00",
        "status": "In stock.",
        "itemDescription": "The PS2 game controller to PC USB converter is perfect for you to use your PlayStation 2 controllers on your PC Via this converter, you can save on extra PC gamepads by re-using your favorite PlayStation controllers and peripherals The PlayStation-to-PC controller adapter allows you to connect up to two PS2 controllers into one USB port. This perfect adapter /converter allows you to get the comforts of using controllers that are made for console-style gaming on your PC"
    },
    {
        "itemName": "video games 98800 in 1 handheld console with tv support through av connections, plug and play device- Multi color",
        "price": " 576.00",
        "status": "In stock.",
        "itemDescription": "98800 games in 1 Handheld Game console Multi Color Handle Grip with additional games Play on any TV with AV Inputs Exclusive USB functions No expensive game console and enjoy hours of fun gaming"
    },
    {
        "itemName": "Frittle PQZ207 400 In 1 SUP Handheld Game Console, Classic Retro Video Gaming Player Colorful LCD Screen USB Rechargeable Portable Game | Best Toy Gift for Kids (Multi Colour)",
        "price": " 539.00",
        "status": "In stock.",
        "itemDescription": "Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it. Applicable to system, so that you can easily enjoy vivid and exciting games on a big screen. Play Longer: 600mAh rechargeable lithium battery, support up to 3-4 hours of continuous game play. 3.0 Inches TFT Color Screen: High definition display, precise images transmission without delaying. Mini Handheld Design: Compact size and lightweight, convenient for carrying. Relaxed yourself at anywhere anytime."
    },
    {
        "itemName": "Devsadan 400 in 1 Sup Game Box Rechargable Console/Led Screen/Retro Classic Gaming",
        "price": " 569.00",
        "status": "In stock.",
        "itemDescription": "Continuous game play EASY TO CARRY -- 3-inch color screen, the surface is made of leather, comfortable touch,small and easy to carry,convenient size and lightweight, perfect for playing travel or on the go. Including retro arcade games, Logic & math, Sports, Puzzle, Shooting, Action, Racing, Fighting, Strategy, Adventure, board games and more. PORTABLE: Mini Handheld Game Console, with 3 inches screen, slim and enough to carry around. BEST GIFT: This is a very suitable birthday/Christmas/holiday present for your kids, friends and anybody who love the old school games. Your satisfaction is our greatest pursuit. If you have any questions, please contact us in time. AV external interface, support video output, AV port can be directly connected to TV and computer display as well, you can switch between big and small screen at will. Take this handheld game anywhere you want to take it. This console will mesmerize your child for long hours. Including retro games, Logic & math, Sports, Puzzle, Shooting, Action, Racing, Fighting, Strategy, Adventure, board games and more."
    },
    {
        "itemName": "TMG New Nintendo 2DS XL Screen Protector Anti-Scratch Tempered Glass Film Games Console For Nintendo New 2DS XL",
        "price": " 499.00",
        "status": "In stock.",
        "itemDescription": "★ Designed for the New Nintendo 3ds XL utilizing laser cutting technology for maximum protection. ★ Made from the High Quality Tempered-Glass with Bubble-Free Adhesives. ★ Protect your Camera against Screen Damage and other accidental damages. ★ Always have a fresh screen protect on your New Nintendo 3ds XL screen to protect against dust and scratches. ★ Compatible With:New Nintendo 3ds XL console.Accessory ONLY, device not included."
    },
    {
        "itemName": "Generic SUP 400 in 1 Games Retro Game Box Console Handheld Game PAD (ASSORTED COLOR)",
        "price": " 499.00",
        "status": "In stock.",
        "itemDescription": "Perfect gift for children, retro game lovers, collectors, etc. Play Longer: 600mAh rechargeable lithium battery, support up to 3-4 hours of continuous game play 3.0 Inches TFT Color Screen: High definition display, precise images transmission without delaying. Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen. Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it."
    },
    {
        "itemName": "GSH DualShock Wireless Controller for PlayStation 3 | Professional PS3 Wireless Gamepad for PlayStation 3/ PS3 Slim / PS3 Super Slim/PS3 Fat by - Ghost Black Limited Edition ( Only Ps3 Compitible , charging cable not included )",
        "price": " 1199.00",
        "status": "In stock.",
        "itemDescription": "Highly sensitive SIXAXIS motion control system enables you to enjoy the real life experience Play wireless with up to 6 group of friends Dual vibration motors gives you best enhanced gaming experience This all new designed controller can help you kill lots of time by playing games with your friends PS3 allow you play games with them in turn, Charging while playing, say goodbye to low battery. Charge Cable make sure remote for PS3 are out of battery, you can still have fun game by the charger cable.(CABLE NOT INCLUDED) Pressure sensors that rumble with each action making every impact feel like you are right in the game. Feel every hit, crash, and explosion with hand-vibrating double shock response. This product is not compitible with PC or Andriod Device only compitible with ps3 charging cable not included in package"
    },
    {
        "itemName": "SME PSP 5V AC Charger/Adapter for Sony PSP Game Console Models 1000/2000/3000",
        "price": " 479.00",
        "status": "In stock.",
        "itemDescription": "Power Input:100V-240~0.3A 50/60HZ, Power output: 5V---1500mA Supports all Sony PSP models 1000, 2000, 3000 and E1004 (Latest model) The Product Has High Speed of Charging Packing Includes: 1 x Power Adapter, 1 x Power Cord. Colour: Black."
    },
    {
        "itemName": "EasySkinz 1200mAh 3.6V Lithium Ion Rechargeable Battery Pack Replacement for Sony PSP 2000/3000 PSP-S110 Console",
        "price": " 799.00",
        "status": "Only 1 left in stock.",
        "itemDescription": "Voltage: 3.6V, Capacity: 1200mAh Rechargeable and no memory effect. Fits right in the battery slot, and you cover it with the PSP battery cover Compatible model: Sony PSP 2000 (2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2010), PSP 3000 (3001, 3002, 3003, 3004, 3005, 3006, 3007, 3008, 3010), PSP Lite, PSP Slim"
    },
    {
        "itemName": "EasySkinz Wireless Controller for PS4 / pro / slim Playstation 4 Dual Shock-4 Blue Camouflage",
        "price": " 3299.00",
        "status": "In stock.",
        "itemDescription": "Pressure sensors that rumble with each action making every impact feel like you are right in the game. Feel every hit, crash, and explosion with hand-vibrating double shock response. Support 6-axis: Highly sensitive motion control systerm senses your every move and characters as well as objects in the game will move and react as you tilt,push and shake the controller. New Ways to Play: Revolutionary features like the touch pad, integrated light bar, and built-in speaker will offer exciting new ways to experience and interact with your games and its 3.5mm audio jack offers a practical personal audio solution for gamers who want to listen to their games in private. Sharing at your Fingertips: The addition of the share button makes sharing your greatest gaming moments as easy as a push of a button.Upload gameplay videos and screenshots directly from your system or live-stream your gameplay, without disturbing the game in progress. 【Comfortable Design,New Ways to Play】Hours of comfortable game play with ergonomically designed grips. Revolutionary features like the touch pad, integrated light bar, will offer exciting new ways to experience and interact with your games. 🎄【Double Vibration,Support 6-axis】Pressure sensors that rumble with each action making every impact feel like you are right in the game. Feel every hit, crash, and explosion with hand-vibrating double shock response. 6-axis:Highly sensitive motion control systerm senses your every move and characters as well as objects in the game will move and react as you tilt,push and shake the controller."
    },
    {
        "itemName": "Pikyo BN006 Portable Video Game Box with Rechargable Console/Led Screen/Retro Classic Gaming Console (Random Color)",
        "price": " 599.00",
        "status": "In stock.",
        "itemDescription": "Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it. Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen. Rechargeable lithium battery, support up to 3-4 hours of continuous game play High definition display, precise images transmission without delaying. Compact size and lightweight, convenient for carrying. Relaxed yourself at anywhere anytime."
    },
    {
        "itemName": "1Up Games USB Wireless Handheld TV Video Game Console Build in 1700+ Classic Games 4K Retro Game Multi Player Console Support for FC SFC GBA MD Arcade, Great Gift",
        "price": " 2699.00",
        "status": "In stock.",
        "itemDescription": "🎮✨ Double six key wireless game stick, double player stimulation PK with 1700 games : unlike other game machines, this time our handle uses six key wireless game stick, which enables us to provide different experience for the game. 🎮✨ Supports five simulators: FC, SFC, GBA, SEGA and MAME 🎮✨ Support downloading and collecting Games: if you don't like our built-in games, please don't worry. You can download games on SD card and collect them 🎮✨ Support instant archiving: each game can save up to 6 different archives 🎮✨ High definition image quality: support 4K TV, display and projector with HD input"
    },
    {
        "itemName": "Devsadan Sup 400 in 1 Retro Game Box Console Handheld Game Pad with Remote/Led Screen/USB Rechargeable Portable Game Compatible with All Devices",
        "price": " 791.00",
        "status": "In stock.",
        "itemDescription": "Continuous game play EASY TO CARRY -- 3-inch color screen, the surface is made of leather, comfortable touch,small and easy to carry,convenient size and lightweight, perfect for playing travel or on the go. Including retro arcade games, Logic & math, Sports, Puzzle, Shooting, Action, Racing, Fighting, Strategy, Adventure, board games and more. PORTABLE: Mini Handheld Game Console, with 3 inches screen, slim and enough to carry around. BEST GIFT: This is a very suitable birthday/Christmas/holiday present for your kids, friends and anybody who love the old school games. Your satisfaction is our greatest pursuit. If you have any questions, please contact us in time. AV external interface, support video output, AV port can be directly connected to TV and computer display as well, you can switch between big and small screen at will. Take this handheld game anywhere you want to take it. This console will mesmerize your child for long hours. Including retro games, Logic & math, Sports, Puzzle, Shooting, Action, Racing, Fighting, Strategy, Adventure, board games and more."
    },
    {
        "itemName": "Gamenophobia Console Charger for Wii , AC Wall Power Adapter Supply Cable Cord for Nintendo Wii (Not for Nintendo Wii U)",
        "price": " 799.00",
        "status": "In stock.",
        "itemDescription": "No Fuss, get started by just plug & play. Supports all Nintendo Wii consoles. 100V-245V Complete World Wide Support. No Need step-downs or voltage converters. Just plug And Play 100% Supports All US/UK/JPN Imported Nintendo Wii Consoles. World Wide Support. has india plug This Wii AC Adapter replaces any lost or broken AC power adapter for the Wii systems 100V-245V Complete World Wide Support. No Need step-downs or voltage converters. Just plug And Play 100% Supports All US/UK/JPN Imported Nintendo Wii Consoles. World Wide Support. Usage Instruction: Please Don't Connect this Charger to any type of spikes or power extension boxes, this type of devises will damage the charger. Connect the charger directly to wall socket only. Also remove/disconnect the plug from socket after use."
    },
    {
        "itemName": "Buddymate 400 in 1 Sup Game Box Rechargable Console/Led Screen/Retro Classic Gaming Console (Blue)",
        "price": " 639.00",
        "status": "In stock.",
        "itemDescription": "Buddymate - 3.0 Inches TFT Color Screen: High definition display, precise images transmission without delaying. Buddymate - Play Longer: 1020mAh rechargeable lithium battery, support up to 3-4 hours of continuous game play 3.0 Inches TFT Color Screen: High definition display. Buddymate - Mini Handheld Design: Compact size and lightweight, convenient for carrying. Relaxed yourself at anywhere anytime. Buddymate - Built-in 400 Classical Games: It's a good gift for your children, friends, both boys and girls will like it. Buddymate - Adapted AV Cable: Applicable to TV system, so that you can easily enjoy vivid and exciting games on a big screen."
    },
    {
        "itemName": "Xbox 360 Wired Black Controller for PC and Microsoft Xbox 360 Console ( Compatible for PC and Xbox 360 Console)",
        "price": " 1299.00",
        "status": "In stock.",
        "itemDescription": "This Product is Compatible with X-Box 360. Compact ergonomics for comfortable play. 100% Works With All X-box 360 Models Just Plug and Play. Gaming at its best - Precise thumb sticks, two pressure-point triggers and an 8-way directional pad help you stay in control. This game controller makes your games more realistic that you will feel every crash, hit, explosion, and more with its dual vibration feedback motors. Works with all Xbox 360 and Windows/PC. Packing Includes: 1 x Controller."
    },
    {
        "itemName": "Redgear Pro Series Wired Gamepad Plug and Play Support for All PC Games Supports Windows/8/8.1/10",
        "price": " 1199.00",
        "status": "In stock.",
        "itemDescription": "Integrated force feedback Illuminated ABXY keys, Ergonomically designed 2 analog triggers 2 analog sticks 11 digital keys 1.8m USB cable X input and Direct input Compatible"
    },
    {
        "itemName": "JoyBox™ Sup Video Game Box with Joystick Classic Portable Gaming Console with 400 in 1 Retro Games",
        "price": " 849.00",
        "status": "In stock.",
        "itemDescription": "Mini Handheld Design: Compact size and lightweight, convenient for carrying. Built-in 400 classical games: it's a good gift for your children, friends, both boys and girls will like it New Sup Video Game With Joystick With New strong Build Quality Plastic Body & Long lasting battery 3.0 Inches TFT Color Screen: High definition display, precise images transmission without delaying. Perfect gift for children, retro game lovers, collectors, etc"
    },
    {
        "itemName": "AmazonBasics Mechanical Feel Gaming Keyboard",
        "price": " 2899.00",
        "status": "In stock.",
        "itemDescription": "Mechanical-feel gaming keyboard; built-to-last keys—switch life of 10-million life cycles; Windows lock switch for Game/Desktop mode (disables Windows/Context Menu keys) Program custom macros to execute complex commands with AmazonBasics gaming software; includes 5 dedicated keys (G1 to G5) and 3 mode keys (M1 to M3) for up to 15 different macros Anti-ghosting keys allow you to press 19 keys at once to execute complex moves with precision; one-touch media controls for quick access to play, pause, mute, and skip song Customize keyboard lighting from a spectrum of 16.8 million colors; easily switch across 3 color profiles for increased visibility; software included (CD or download) for customizing light effects Compatible with Windows 7, 8, and 10 1 year limited warranty For customer service and warranty related queries please contact us: [1800-419-0416] (available Monday to Saturday from 9:30 AM to 6:00 PM except national holidays)"
    },
    {
        "itemName": "GHS PSP Console Battery Series 3.6 V 1200 M Ah Loose Packing (New) PSP-S110 Compatible PSP Slim Portable Playstation PSP-2000, PSP-2001, PSP-3000, PSP-3001, PSP-3002, PSP-3004",
        "price": " 1120.00",
        "status": "In stock.",
        "itemDescription": "Voltage: 3.6V, Capacity: Fits right in the battery slot, and you cover it with the PSP battery cover Compatible model: Sony PSP 2000 (2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2010), PSP 3000 (3001, 3002, 3003, 3004, 3005, 3006, 3007, 3008, 3010), PSP Lite, PSP Slim 1200mAh Rechargeable and no memory effect."
    },
    {
        "itemName": "Graphixdesign Dead-pool King Red 3M Skin Decal Sticker For X Box One X Console & Two Controllers",
        "price": " 599.00",
        "status": "In stock.",
        "itemDescription": "Graphixdesign skin is created using two ingredients: quality materials and precision cuts. Everyone knows that 3M is the global leader in premium vinyl - that's why we use only 3M vinyl. It's the same vinyl that's used to wrap Lambos, so you can trust that it's good enough for your gaming console. Our skins are guaranteed to stick to your console perfectly and leave no adhesive goo behind when (if?) you decide to take it off. unrivaled precision, premium materials,installation. PROTECTION - The look of carbon fiber while preventing dust and scratch damage to the system components themselves. Fade (UV Resistant)，waterproof, oil proof and fingerprints prevent.Prevent scuffing of your Xbox One X . Give your Xbox One X for more protection. PERSONALIZE - Stylish adhesive skins customize the look of your Xbox One X console with a sleek and clean appearance.Easy to apply and remove, leaves no sticky residue, will not damage surfaces. HIGHEST QUALITY - Full Color, \"Anti-Slip\" Grip-Like Vinyl \"Sticker\".Extremely thin, lightweight, durable.Skins fit Micros ADD TO CART - High resolution and personalized graphics. It looks great and cool on your Xbox One X . Your Xbox One X will stand out from the crowd.Let's play game with this sticker! What are you waiting for, Click the ADD TO CART Button now ."
    },
    {
        "itemName": "ELTON PS5 Skin Protective Wrap Cover Vinyl Sticker Decals for PlayStation 5 Disk Version Console and Two Dual Sense 5 Sticker Skins Black PS5 Skin Console and Controllerdesign488",
        "price": " 999.00",
        "status": "In stock.",
        "itemDescription": "ELTON skin is created using two ingredients: quality materials and precision cuts. Everyone knows that 3M is the global leader in premium vinyl - that's why we use only 3M vinyl. It's the same vinyl that's used to wrap Lambos, so you can trust that it's good enough for your gaming console. Our skins are guaranteed to stick to your console perfectly and leave no adhesive goo behind when (if?) you decide to take it off. unrivaled precision, premium materials, and a super simple installation. This skin is made of high quality 3M layered vinyl with high digitally UV printed resolution design, Laser cut ,protect your ps5 console and controllers from scratch and dust without fading. Easy to install and use, bubble-free sticker, clean removal, leaves behind no sticky residue after removal. The decal wrap is compatible with the playstation 5 disk version and the dualsense 5 controllers. (package includes 1 console wrap + 2 controller wraps). Stylish Appearance: Decorate and beautify your console and controllers without affecting the operation."
    },
    {
        "itemName": "ELTON PS5 Skin Protective Wrap Cover Vinyl Sticker Decals for PlayStation 5 Disk Version Console and Two Dual Sense 5 Sticker Skins Black PS5 Skin Console and Controller design484",
        "price": " 999.00",
        "status": "In stock.",
        "itemDescription": "ELTON skin is created using two ingredients: quality materials and precision cuts. Everyone knows that 3M is the global leader in premium vinyl - that's why we use only 3M vinyl. It's the same vinyl that's used to wrap Lambos, so you can trust that it's good enough for your gaming console. Our skins are guaranteed to stick to your console perfectly and leave no adhesive goo behind when (if?) you decide to take it off. unrivaled precision, premium materials, and a super simple installation. This skin is made of high quality 3M layered vinyl with high digitally UV printed resolution design, Laser cut ,protect your ps5 console and controllers from scratch and dust without fading. Easy to install and use, bubble-free sticker, clean removal, leaves behind no sticky residue after removal. The decal wrap is compatible with the playstation 5 disk version and the dualsense 5 controllers. (package includes 1 console wrap + 2 controller wraps). Stylish Appearance: Decorate and beautify your console and controllers without affecting the operation."
    },
    {
        "itemName": "SmartCam® video games 98800 in 1 handheld console with tv support through av connections, plug and play device- Multi color",
        "price": " 689.00",
        "status": "In stock.",
        "itemDescription": "98800 games in 1 Handheld Game console Multi Color Handle Grip with additional games Play on any TV with AV Inputs Exclusive USB functions No expensive game console and enjoy hours of fun gaming"
    },
    {
        "itemName": "ShopWaves _400 in 1 Sup Game Box Rechargable Console/Led Screen/Retro Classic Gaming Console Red Color",
        "price": " 1195.00",
        "status": "Only 1 left in stock."
    },
    {
        "itemName": "GADGETSWRAP Travel Carrying Case Multifunctional Travel Storage Carry Case Protective Shoulder Bag PlayStation4 PS4 Slim System Console Accessories (PS4 Slim)",
        "price": " 1499.00",
        "status": "In stock.",
        "itemDescription": "Travel Storage Carry Shoulder Bag PlayStation4 PS4 Slim System Console Accessories For PS4 Slim Black Color Multifunctional Travel Storage"
    },
    {
        "itemName": "REES52 Game Pi 4 3 Accessories Classic Portable Retro Video Game Console Compatible with Raspberry Pi 3 B+/3B/2B/B+, with 800×480 4.3inch IPS Display",
        "price": " 6999.00",
        "status": "In stock.",
        "itemDescription": "This is a portable retro video game console based on Raspberry Pi, onboard 800×480 pixels 4.3inch IPS display This Gamepi43 Compatible with Raspberry Pi B+/2B/3B/3B+ Comes with 60 fps smooth gaming experience Integrates battery charge circuitry, powered from 18650 lithium batteries (NOT included), plays anywhere anytime.Battery life indicator Onboard speaker and earphone jack, listen to the familiar BGM from the old days.Volume and backlight adjustment keys, adjust the device status according to specific game, better experience"
    },
    {
        "itemName": "EasySkinz Wired Controller Compatible with Xbox 360 and Windows 10/8.1/8/7 (Black)",
        "price": " 1999.00",
        "status": "In stock.",
        "itemDescription": "Wide Compatibility - Wired Controller Compatible with Xbox 360/Xbox 360 Slim and PC (Windows 7 8 10) 3 Levels of Rumble Control- Full/Medium/Low or Off to Match Your Personal Preference Double Vibration - Vibrating Motors are Embedded in the Side Grips and Deliver Distinct Feedback During the Game, Enhancing the Immersion and Realism of the Game Scenarios Ergonomics Design -The Asymmetrical Design of the Joysticks is Based on Ergonomics and Designed for the Most Comfortable Thumb Position. The Gamepad's Shape Fits Your Hands Naturally Package includes: 1 Wired Controller"
    },
    {
        "itemName": "Smartcam Sup 400 in 1 games with 2 player Retro Game Box Console Handheld Game Pad with Remote / Led Screen / USB Rechargeable Portable Game Compatible with All Devices",
        "price": " 999.00",
        "status": "In stock.",
        "itemDescription": "AV external interface, support video output, AV port can be directly connected to TV and computer display as well, you can switch between big and small screen at will. Take this handheld game anywhere you want to take it. This console will mesmerize your child for long hours. Including retro games, Logic & math, Sports, Puzzle, Shooting, Action, Racing, Fighting, Strategy, Adventure, board games and more. Continuous game play EASY TO CARRY -- 3-inch color screen, the surface is made of leather, comfortable touch,small and easy to carry,convenient size and lightweight, perfect for playing travel or on the go. Including retro arcade games, Logic & math, Sports, Puzzle, Shooting, Action, Racing, Fighting, Strategy, Adventure, board games and more. PORTABLE: Mini Handheld Game Console, with 3 inches screen, slim and enough to carry around. BEST GIFT: This is a very suitable birthday/Christmas/holiday present for your kids, friends and anybody who love the old school games. Your satisfaction is our greatest pursuit. If you have any questions, please contact us in time."
    }
]