[
    {
        "itemName": "Marvel's Spider Man (PS4) - Game of the Year Edition (PS4)",
        "price": " 1483.00",
        "status": "In stock.",
        "itemDescription": "The city that never sleeps DLC with additional mission and challenges This is an all-new spider-man universe, featuring familiar characters in unfamiliar roles, take control of a complex dual life, as a young adult with great powers… and evolving relationships Swing freely through Marvel’s new York City in epic action set-pieces filled with a rich narrative and relatable characters Country of Origin: Austria"
    },
    {
        "itemName": "PS4 God of War (PS4)",
        "price": " 976.00",
        "status": "In stock.",
        "itemDescription": "His vengeance against the gods of Olympus behind him, Kratos now lives in the realm of Norse deities and monsters It’s in this harsh, unforgiving world that he must fight to survive, and not only teach his son to do the same… but also prevent him from repeating the ghost of sparta’s bloodstained mistakes God of war combines all the hallmarks of the iconic series – brutal combat, epic boss fights and breath-taking scale – and fuses them with a powerful and moving narrative Country of Origin: Austria"
    },
    {
        "itemName": "PS4 Ghost of Tsushima (PS4)",
        "price": " 2172.00",
        "status": "In stock.",
        "itemDescription": "As the island burns in the wake of the first wave of the mongol assault, samurai warrior jin sakai stands as one of the last surviving members of his clan Venture beyond the battlefield to experience feudal Japan like never before. In this open-world action adventure, you’ll roam vast countryside's and expansive terrain to encounter rich characters Explore meticulously-crafted regions showcasing diversity of life on the sprawling island—from billowing fields and tranquil shrines to ancient forests, villages and stark mountainscapes The rise of the ghost - jin was raised and trained in the ways of the samurai. When the mongols handily defeat the samurai forces, jin’s world is shattered Mud, Blood and steel-the mongol enemy is unpredictable and formidable in warfare and weaponry. Get the upper hand by adapting jin’s skills and learning new tactics to defend"
    },
    {
        "itemName": "Marvel's Spider Man (PS4)",
        "price": " 1488.00",
        "status": "In stock.",
        "itemDescription": "An experienced Spider-Man with several years of crime fighting under his belt, Peter Parker has sheer mastery of his powerful spider-sense, dynamic skills, acrobatic abilities and new suit This is an all-new Spider-Man universe, featuring familiar characters in unfamiliar roles, Take control of a complex dual life, as a young adult with great powers… and evolving relationships Swing freely through Marvel’s New York City in epic action set-pieces filled with a rich narrative and relatable characters"
    },
    {
        "itemName": "Grand Theft Auto V – Premium",
        "price": " 1706.00",
        "status": "In stock on April 18, 2021. Order it now.",
        "itemDescription": "The Grand Theft Auto V: Premium Edition Includes The Complete Grand Theft Auto V Story Experience, Free Access To The Ever-Evolving Grand Theft Auto Online + The Criminal Enterprise Starter Pack The Criminal Enterprise Starter Pack - The Criminal Enterprise Starter Pack Is The Fastest Way For New GTA Online Players To Jumpstart Their Criminal Empires With The Most Exciting And Popular Content Plus $1,000,000 Bonus Cash To Spend In GTA Online - All Content Valued At Over Gta$10,000,000 If Purchased Separately Grand Theft Auto V - When A Young Street Hustler, A Retired Bank Robber And A Terrifying Psychopath Land Themselves In Trouble, They Must Pull Off A Series Of Dangerous Heists To Survive In A City In Which They Can Trust Nobody, Least Of All Each Other A Fleet Of Powerful Vehicles - Tear Through The Streets With A Range Of 10 High Performance Vehicles Including A Supercar, Motorcycles, The Weaponized Dune Fav, A Helicopter, A Rally Car And More. You’ll Also Get Properties Including A 10 Car Garage To Store Your Growing Fleet Weapons, Clothing & Tattoos - You’ll Also Get Access To The Compact Grenade Launcher, Marksman Rifle And Compact Rifle Along With Stunt Racing Outfits, Biker Tattoos And More"
    },
    {
        "itemName": "FIFA 20 (PS4)",
        "price": " 1435.00",
        "status": "In stock.",
        "itemDescription": "This is a Region 2 copy (official Indian SKU). Only Region 2 copy owners will be able to use FUT points redeemed at PSN India store FIFA 20 will see more legendary football players & New kits Varied modes to test your skills and strategies The franchise has been recognized over the years for acquiring licenses from incredible leagues over the world"
    },
    {
        "itemName": "PS4 The Last of Us Part II (PS4)",
        "price": " 1899.00",
        "status": "In stock.",
        "itemDescription": "The cycle of violence left in her wake will challenge your notions of right versus wrong, good versus evil and hero versus villain Brought to life by the latest iteration of the Naughty Dog engine, the deadly characters and world are more realistic and meticulously detailed than ever before A broad variety of weapons, crafting items, skills and updates allows you to personalise ellie’s capabilities to your play style Country of Origin: Austria"
    },
    {
        "itemName": "Red Dead Redemption - 2 (PS4)",
        "price": " 2074.00",
        "status": "In stock.",
        "itemDescription": "Get ready to tame the Wild West, Red Dead is back with a vengeance and the west may never be the same Red Dead Redemption 2 is the sequel to the wildly popular open-world western action-adventure video game The game's vast and atmospheric world will also provide the foundation for a brand new online multiplayer experience Edition: Standard Edition"
    },
    {
        "itemName": "Uncharted Collection Hits (PS4)",
        "price": " 888.00",
        "status": "Only 1 left in stock.",
        "itemDescription": "Uncharted collection PlayStation hits (PS4) Brand-new trophies created exclusively for uncharted's debut on the PS4 system Freeze gameplay at any time and take control of the camera to capture your most memorable moments from the trilogy to share with friends directly from your ps4 system; Utilize graphical filters, camera controls and other options to customize your shot"
    },
    {
        "itemName": "Far Cry 5 (PS4)",
        "price": " 1399.00",
        "status": "In stock.",
        "itemDescription": "Spark the fires of resistance against a fanatic cult: Stranded in hostile territory, find strength in the community around you to lead a resistance against a cult taking over Hope County, Montana Carve your own path: The freedom to go in any direction - you decide the when, the where and the how From the moment you enter Hope County you have the freedom to tackle the world in any order you choose A world that evolves: Play your way against Joseph Seed and his fanatical followers in a dynamic open world that adapts and reacts to the choices you make"
    },
    {
        "itemName": "Days Gone - (PS4)",
        "price": " 1377.00",
        "status": "In stock.",
        "itemDescription": "Expansive open world action - exemplifying truly free-form gameplay, days gone offers freedom to explore, strategize and play \"your way\" in the vast high-desert of the pacific northwest; The hazardous environments, filled with carved out ridges, mountains, caves, cliffs mines and river basins, deliver a breath-taking backdrop to an equally diverse style of gameplay Emergent gameplay - featuring fully explorable environments and dynamic AI enemies, players will rely on their own abilities to strategize, craft weapons and tools, explore the world and engage in combat; With almost every car, building and environment searchable, days gone delivers emergent gameplay possibilities, making a player's approach to combat and discovery a vital part of the experience Stunning, dynamic graphics - using the power of PlayStation 4 and unreal engine 4, bend studio has developed a high volume of rendering and gameplay technology to deliver an incredibly realistic open world experience; Realistic weather effects, such as rain, wind, snow and day-night cycles impact the gameplay; The game's lighting is all real-time and reacts dynamically, the way the human iris does, as players move from one location to the next"
    },
    {
        "itemName": "Hitman 2 (PS4)",
        "price": " 1499.00",
        "status": "In stock.",
        "itemDescription": "Travel the globe and track your targets across exotic sandbox locations in hitman. From sun-drenched streets to dark and dangerous rainforests, nowhere is safe from the world’s most deadly assassin, Agent 47 New ways to hit The best hitman experience to date Only in hitman can you use everything in your environment to help plan and execute the perfect assassination – use stealth, sabotage, and everything in-between to turn your creativity into a deadly weapon"
    },
    {
        "itemName": "Grand Theft Auto V – Premium",
        "price": " 1706.00",
        "status": "In stock on April 18, 2021. Order it now.",
        "itemDescription": "The Grand Theft Auto V: Premium Edition Includes The Complete Grand Theft Auto V Story Experience, Free Access To The Ever-Evolving Grand Theft Auto Online + The Criminal Enterprise Starter Pack The Criminal Enterprise Starter Pack - The Criminal Enterprise Starter Pack Is The Fastest Way For New GTA Online Players To Jumpstart Their Criminal Empires With The Most Exciting And Popular Content Plus $1,000,000 Bonus Cash To Spend In GTA Online - All Content Valued At Over Gta$10,000,000 If Purchased Separately Grand Theft Auto V - When A Young Street Hustler, A Retired Bank Robber And A Terrifying Psychopath Land Themselves In Trouble, They Must Pull Off A Series Of Dangerous Heists To Survive In A City In Which They Can Trust Nobody, Least Of All Each Other A Fleet Of Powerful Vehicles - Tear Through The Streets With A Range Of 10 High Performance Vehicles Including A Supercar, Motorcycles, The Weaponized Dune Fav, A Helicopter, A Rally Car And More. You’ll Also Get Properties Including A 10 Car Garage To Store Your Growing Fleet Weapons, Clothing & Tattoos - You’ll Also Get Access To The Compact Grenade Launcher, Marksman Rifle And Compact Rifle Along With Stunt Racing Outfits, Biker Tattoos And More"
    },
    {
        "itemName": "Call of Duty: Infinite Warfare (PS4)",
        "price": " 748.00",
        "status": "In stock.",
        "itemDescription": "The latest game in the world's best selling video game franchise - 'Call of Duty' Campaign: Return to the gritty, large-scale war roots of the franchise, while boldly looking ahead Multiplayer: Delivers the future of warfare, with many new gameplay innovations Zombies: A wild ride through a new storyline with unique gameplay features and mechanics"
    },
    {
        "itemName": "The Last of US Hit (PS4)",
        "price": " 935.00",
        "status": "In stock.",
        "itemDescription": "The Last of Us: Remastered (PS4) An intense character-driven narrative from legendary developers Naughty Dog Explore a horrific America forever changed by the pandemic Country of Origin: Austria"
    },
    {
        "itemName": "Assassins Creed: Odyssey (PS4)",
        "price": " 1648.00",
        "status": "In stock.",
        "itemDescription": "First released in 2007, assassin’s creed is an award-winning video game series that has had multiple spin-offs; The series has been released amongst nearly all consoles including previous generations and is one of the biggest in the gaming industry Assassin’s creed has followed the story of the secret war that seems to be never-ending; The assassin brotherhood and the Templar order have been fighting in many different historical settings from around the world No more details have been released and ubisoft have promised to reveal more information at E3 2018; Tune back in for further information and pre-order assassin’s creed: odyssey today"
    }
]