[
    {
        "itemName": "RIVER Manish Arora Regular Fit T-Shirt with Half Sleeves",
        "price": " 1050.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand Wash Only Fit Type: Regular Fit T-shirt with Half Sleeves RIVER x Manish Arora Men's Placement Print Designer T-shirt with V neck collar Regular Fit T-shirt with Half Sleeves Color Name : Violet Material : 100% Cotton"
    },
    {
        "itemName": "SOLO Men’s Designer Round Neck Cotton Muscle Tee Vest Casual Sleeveless/Classic Soft Stretchable Short Crew Undershirt (Pack of 3)",
        "price": " 780.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Wash with like colours, wash inside out Fit Type: Classic Fit 175 GSM pure cotton with rib fabric that makes you to feel comfortable Size: XS (30\"/75cm - Chest); Small (32\"/80cm - Chest); Medium (34\"/85cm - Chest); Large (36\"/90cm); XL (38\"/95cm - Chest); XXL (40\"/100cm - Chest); 3XL (42\"/105cm - Chest) Unique high neck cut for sweat absorption; Moisture-wicking properties keep you cool and Dry Seamless side finish for extra comfort; Flexible fit due to rib fabric To be worn as innerwear, loungewear and sportswear - for all purpose use"
    },
    {
        "itemName": "Katso Mens Cotton Hooded T-Shirt(Combo Pack of 2)",
        "price": " 699.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand Wash Only Fit Type: Slim Fit Comfort : Best Fashionably Comfortable Hundred Percent Cotton T-Shirt that you have wore till now. Quality :All garments are subjected to the following tests Fabric dimensional stability test and print quality inspection for colours and wash fastness. Seller: Buy Original Tshirt by seller name Katso Designs Light weight fabric sweeps sweat away from your skin and helps regulate body temperature. Product color may slightly vary due to photographic lighting sources or your monitor settings."
    },
    {
        "itemName": "Scott International Men's Regular Fit T-Shirt (Pack of 3)",
        "price": " 468.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Fabric: 100% Cotton Style: Regular Neck Style: Round Neck Pattern: Solid"
    },
    {
        "itemName": "EYEBOGLER Regular Men's Cotton Designer T-Shirt (EB1T67)",
        "price": " 399.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Unique Design with Excellent durable fabric Soft flow dyed 60% Cotton, 40% Polyester Fabric Fabric GSM is 180 Machine wash Cold Regular Fit and dimensionally accurate size"
    },
    {
        "itemName": "Allen Solly Men's Polo",
        "price": " 539.00",
        "itemDescription": "Care Instructions: Wash with mild detergent, do not bleach, dry in shade Fit Type: Regular Fit 60% cotton and 40% polyester ; There Might Be Minor Color Variation Between Actual Product And Image Shown On Screen Due To Lighting On The Photography Regular fit Banded collar Half sleeve Wash with mild detergent, do not bleach, dry in shade"
    },
    {
        "itemName": "Vimal Men Poly-Viscose Unstitched Trouser Fabric",
        "price": " 419.00",
        "status": "In stock.",
        "itemDescription": "Trouser Fabric For Men Color: Blue, Size : 1.2 Meters Ideal For Office and Meetings as well as for Casual Functions Material : Poly-Viscose Blend Vimal - A Reliance Industries Brand."
    },
    {
        "itemName": "PAUSE Men's Solid Cardigan",
        "price": " 299.00 - ₹ 399.00",
        "itemDescription": "Care Instructions: Dry In Shade Fit Type: Slim Fit Fabric: Cotton Sleeve: Long Sleeve Neck Style: Round Neck Pattern: Solid"
    },
    {
        "itemName": "KUNDAN SULZ GWALIOR Men's Poly Cotton Formal 1.2 m Unstitched Trousers Fabric (Navy Blue, Beige and Black, Free Size) - Pack of 4",
        "price": " 1199.00",
        "status": "In stock.",
        "itemDescription": "Kundan sulz gwalior exclusive collection of trouser and shirt combo set available fashion unlimited - exclusive trendy suiting and shirting fabric We are one of the leading manufacturer of suiting and shirting our registered trade mark kundan sulz gwalior if any one using our product Fabric :- pant fabric : navy blue ( deep blue ), blue, beige and black colour poly viscose blended 4 pieces self design trouser fabric, disclaimer :- product colour may vary due to photographic lighting sources or your display settings Length:- 120m trouser fabric sufficient to stitch 36 size formal trouser"
    },
    {
        "itemName": "Raymond Men's Poly Blend 2.5 m Unstitched Shirt Piece (White, Free Size)",
        "price": " 480.00",
        "status": "In stock.",
        "itemDescription": "Fit Type: Regular Fit Raymond White Poly Blend Unstitched Shirt Piece Poly Blend (2.5 Mtr)"
    },
    {
        "itemName": "Linen Fabric VK's Men's Linen 1.60 m Unstitched Shirt (White, Free Size)",
        "price": " 299.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Gentle machine wash, Do not bleach, Dry in shade Fit Type: Regular Fit Material - cotton linen, color: white, length: 1.60 meters, width 140 cm"
    },
    {
        "itemName": "Scott International Men's Regular Fit T-Shirt (Pack of 3)",
        "price": " 509.00 - ₹ 519.00",
        "itemDescription": "Care Instructions: Do Not Bleach. Wash with similar colours. Machine wash cold Fit Type: Regular Fit Fabric: Cotton Style: Regular Neck Style: Round Neck Pattern: Striped Sleeve Type: Half Sleeve"
    },
    {
        "itemName": "0-Degree Men's Running Shorts",
        "price": " 799.00",
        "status": "In stock.",
        "itemDescription": "3/4 shorts for men cotton are made of 100% Cotton Half pants for men cotton have elastic waist with button Mens Shorts Casual have Cargo shorts for men stylish Multi-Utility Pockets Sports shorts men have balance of Style and comfort. Can be used as gym shorts for mens or running shorts men three fourth pants for men shorts cotton end few inches below knee.Short pant for men can be used as bermuda for men or capri for men cotton"
    },
    {
        "itemName": "ZORO Men's Stretchable Stylish Flexible Belt, (BROWN, TAN SCB30)",
        "price": " 299.00",
        "status": "In stock.",
        "itemDescription": "PU leather belt with Automatic retched buckle (No need to punch holes) (Imported Material) One size belt (48 inch belt length). Perfectly fits on upto 42 inch of waist size. 1 year guarantee against any manufacturing defect Easily adjustable, belt buckle can be remove easily which gives flexibility to short belt size"
    },
    {
        "itemName": "ZORO Men's Nylon Tactical Military Style Webbing Belt with Metal Buckle (Green, Free Size)",
        "price": " 499.00",
        "status": "In stock.",
        "itemDescription": "Size:Belt Length,120Cm/47\"; Width,3.8Cm/1.5\"; Buckle Length, 7.5Cm/3\"; Width:6.4Cm/2.5\" Buckle: Featuring A Military Belt Buckle,Made From Heavy-Duty Buckle, Quick Release And Non-Slip Belt: Durable, Adjustable. Using Strong High-Quality Nylon Canvas Fabric, Breathable And Comfortable,Wear-Resisting Color: Black, Brown,Army Green,Royal Blue And Camouflage Suit For: Practical And Tactical Design Ideal For All Occasions Looks Great Dressed Up Or Down, Hiking, Crossing, Camping, Rafting, Skiing, Fishing, Cycling, Traveling, Shopping Etc"
    },
    {
        "itemName": "Jockey Men's Cotton Boxers (Pack of 2)(1222-0210-ASSTD Boxer Shorts XXL)",
        "price": " 736.00",
        "status": "In stock.",
        "itemDescription": "100% Mercerized combed cotton and woven fabric Do not bleach, normal wash, tumble dry low Style No: 1222 ; Collection Name: RELAX Collection: Relax ; Style Code: 1222 Made in India Product comes in assorted prints. Actual colors and prints might vary for the image shown on the website Plus size available from size 38/XXL onwards Country of Origin: India"
    },
    {
        "itemName": "Dennis Lingo Men's Slim Fit Casual Shirt",
        "price": " 549.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Slim Fit Material: Cotton Slim fit Nehru/Mandarin collar Long sleeve Regular machine wash"
    },
    {
        "itemName": "Jack & Jones Men's Cotton Reusable 3 Layer Protective Fashion Cloth Mask (Pack of 3) (12187804_Capers _OS)",
        "price": " 479.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: machine wash Color name: Capers Material: Cotton Machine Wash"
    },
    {
        "itemName": "Kuber Industries Cotton 6 Piece Men's Handkerchief Set - White (CTKTC05660)",
        "price": " 219.00",
        "status": "In stock.",
        "itemDescription": "Color: White, Size Name: Standard Material: Cotton, GSM: 144 Package Contents: 6 Piece Men's Handkerchief Size: Handkerchief: 17.2 inch x 16.9 inch or 44 cm x 43 cm Made of high quality cotton and this has sweat or water absorbing quality, this set is weaved using the finest quality fabric It is perfect to use for your face area, we ensure that we provide the best quality for your money, you will definitely feel more confident while holding this handkerchief in your hand This is good habit to carry handkerchief so, please purchase this handkerchief set Country of Origin: India"
    },
    {
        "itemName": "DIGITAL SHOPEE Men's Cotton Shorts Boxers, Pack of 5 (Medium, Multicolour)",
        "price": " 499.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand Wash Only Fit Type: Regular Fit Pure cotton Elastic waistband soft woven fabric with two side pocket Combed fabric for superior softness and lustre tagless comfort - no more scratchy labels Fitting type: Regular fit and medium size (30inches)."
    },
    {
        "itemName": "SIFOJON Men's Cotton Lining Digital Printed Shirt Fabric (Free Size) Bye 2 get 1 free",
        "price": " 425.00",
        "status": "In stock.",
        "itemDescription": "size:2.5 miter Material - Cotton Pattern - Eiffel Tower brand : SIFOJ0N"
    },
    {
        "itemName": "Nidhi Sequence Men's Rayon Cotton Lining Digital Printed Un-Stitched Half Sleeve Shirt 1.25 mtr Unstitched Shirt Fabric",
        "price": " 385.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand Wash Only Fit Type: Regular Fit Stylish Half sleeve casual Printed Shirts Fabric 1.25 meters & Touring / party Wear Casual shirts pieces Pattern: Digital Printed Cotton Shirts fabric & Party Wear Printed Cotton Shirts. Stylish Printed Casual Fabric for Shirt 100% premium Cotton, pre washed for an extremely soft finish and rich look Breathable : truly comfortable and easy to wear in every season it is insulating in winter and breathable in summer Men's Poly Cotton Multicolor Digital Print Unstitched Shirt Fabric ( 1.25 Meter) Fabric Details : Brand:- Rayon , Material:- Rayon , Size :- Width :- 58\" Inch (Panna), Pattern :- Printed, Feel :- Very Soft, Color :- Multicolor Print, Occasion :- Casual"
    },
    {
        "itemName": "US Polo Association Men's Cotton Headband (Pack of 3) (USMAK0011_Navy_Large)",
        "price": " 499.00",
        "status": "Only 4 left in stock.",
        "itemDescription": "Care Instructions: hand wash Color: Navy Top And Bottom Layers - 160 Gsm 100% Cotton Single Jersey | Inside Layer - 100% Polyester Hand wash Made in India"
    },
    {
        "itemName": "Kundan Sulz Gwalior Men's Poly Cotton Shirt and Trouser Fabric (Multicolour_1.20 and 2.25 Meters) - Pack of 4",
        "price": " 1499.00",
        "status": "In stock.",
        "itemDescription": "Pack of 4 pant and shirt pieces, colour :- each piece of shirt and trouser fabric in different colour combinationt, pattern:- self desige and checks pattern pant pieces and checks pattern shirt pieces, exclusive office wear and party wear, fabric :- pant fabric poly viscose shirt fabric poly-cotton, length:- 1.20 meters pant fabric and 2.25 meters ( 36\") shirt fabric Kundan has an marvelous collection of packs that make for perfect gifts. celebrate festivals, special occasions and every moments with the gift pack from kundan. whether it's a wedding or a birthday party, there is a stylish gift pre-packed by kundan product seen in the image is for packing illustration of the material. this is a - kundan product Disclaimer: Product Color and Design will be send randomly"
    },
    {
        "itemName": "EYEBOGLER Regular Fit Men's Cotton T-Shirt",
        "price": " 399.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Care Instructions: Machine wash Fit Type: regular fit Cotton Polyester Blend: 60% Cotton and 40% Polyester Regular fit and dimensionally accurate size Unique design with excellent durable fabric"
    },
    {
        "itemName": "Kuber Industries Cotton 6 Piece Men's Handkerchief Set - White",
        "price": " 191.00",
        "status": "In stock.",
        "itemDescription": "Color: White, Size Name: Standard Material: Cotton, GSM: 144 Package Contents: 6 Piece Men's Handkerchief Size: Handkerchief: 17.2 inch x 16.9 inch or 44 cm x 43 cm Made of high quality cotton and this has sweat or water absorbing quality, this set is weaved using the finest quality fabric It is perfect to use for your face area, we ensure that we provide the best quality for your money, you will definitely feel more confident while holding this handkerchief in your hand This is good habit to carry handkerchief so, please purchase this handkerchief set"
    },
    {
        "itemName": "ZORO Unisex Canvas Waist Belt (Pack of 2) (COMBO-49)",
        "price": " 399.00",
        "status": "In stock.",
        "itemDescription": "Material: made of nylon belt + ykk buckle, firm and durable Features: anti-allergy, anti-friction and quick-drying Automatic buckle: wear easily and fast, just press down the buckle when belt go through it Length: About 125CM, You can take off the buckle and cut off if its too long for you This belt do not have hole, it can be adjusted to any place of the belt, all people whose waistline 108cm(42.5inch) will suit for it"
    },
    {
        "itemName": "Amazon Brand - Symbol Men's Regular fit T-Shirt",
        "price": " 499.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Color name: Multicolor1 Material: Cotton Pattern: solid half sleeve machine wash"
    },
    {
        "itemName": "Giordano Men's Slim Fit Casual Polo Tshirt",
        "price": " 1374.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Slim Fit Fabric Material : 97% Cotton, 3% Lycra Half Sleeve with Polo Collar Tshirt gives rich look as per latest trend for men's fashion T-Shirt style: good to go for any casual scene, express your style with these stylish men's t-shirts that reflect your personality Wash instructions: Machine wash, Do not bleach,Wash dark colors separately"
    },
    {
        "itemName": "Diverse Men's Chino Shorts Slim Cotton",
        "price": " 509.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Slim Material - 100% Cotton Fit Type - Slim Fit Zip fly with button closure Basic 5 Pocket Shorts Machine wash"
    },
    {
        "itemName": "VIMAL JONNEY Men's Poly Cotton Unstitched Fabric for Shirt and Trouser Combo Pack (Random Multicolor and Designs, Free Size)",
        "price": " 2449.00",
        "status": "Only 1 left in stock.",
        "itemDescription": "Fit Type: Regular Fit Random colors and design combination will come Pack of 6 A quality product from the house of Vimal a Reliance Product Material: Poly Cotton (Random Colors & Designs Pack of 6 Shirts and 6 trousers. Images are just for reference in respect of brand & packaging of the product) Size : Pant and Shirt piece of standard 1.2m and 2.25m. Each combo will come in individual Gift Box Ideal For Personal use as well as Gifting."
    },
    {
        "itemName": "Amazon Brand - Symbol Men's Regular Pyjamas",
        "price": " 399.00",
        "itemDescription": "Care Instructions: machine wash Fit Type: Regular Care Instructions: Machine wash Machine wash warm, wash dark colors separately, do not bleach, tumble dry low, warm iron, do not iron 100% Cotton Attractive colors and designs Comfortable elastic waist band This product is non-returnable"
    },
    {
        "itemName": "KUNDAN SULZ GWALIOR Men's Unstitched Blue Linen Look 2.25 m Shirt and Dark Brown Coffee 1.20 m Trouser Fabric Combo Set (Free Size)",
        "price": " 599.00",
        "status": "Only 4 left in stock.",
        "itemDescription": "Disclaimer: - product color may vary due to photographic lighting sources or your display settings A marvellous collection of packs that make for perfect gifts celebrate festivals, special occasions and every moments with the gift pack from kundan whether it's a wedding or a birthday party, there is a stylish gift pre packed by kundan product seen in the image is for packing illustration of the material this is a kundan product We are one of the leading manufacturer of suiting and shirting our registered trade mark Colour: - dark brown ( Coffee ) color formal trouser fabric and blue color poly-cotton linen look shirt pieces, pattern: - self design pant pieces and linen look shirt pieces, office wear and party wear, fabric: - pant fabric poly viscose shirt fabric poly-cotton, length: - 1 20 meters pant fabric and 2 25 meters ( 36\") shirt fabric"
    },
    {
        "itemName": "Vimal Men Poly-Viscose Unstitched Trouser Fabric",
        "price": " 435.00",
        "status": "Only 3 left in stock.",
        "itemDescription": "Care Instructions: Machine Wash Material: Poly Viscous (80-Poly & 20-Viscous), Pattern: Self Design, Color : Black Original Vimal (A Reliance Product) Unstitched Trouser Fabric / Unstitched Pant Fabric for Men Good for Personal use. Can Be Used for Corporate Gifting, Marriage Gift, Birthday Gift - Ideal for Formal, Casual, Semi-Casual, Evening and Party Wear. DEO2 Technology Anti - Microbial Treated Fabric that arrests growth of fungi on fabrics and keeping it fresh and anti-odour even after day-long wearing in humid and warm climates Fabric Care: Gentle machine wash, Do not bleach, Dry in shade, Medium to Hot Iron."
    },
    {
        "itemName": "Lux Cottswool Men's Cotton Thermal Set",
        "price": " 599.00 - ₹ 985.00",
        "itemDescription": "Care Instructions: Gentle wash in lukewarm water, do not bleach 100% Cotton processed to draw moisture away Size XS/75 S/80 M/85 L/90 XL/95 2XL/100 3XL/105 4XL/110 , Chest (In CM) 96, 101, 106, 111, 116, 121, 127, 132 , Waist (In CM) 66, 71, 76, 81, 86, 91, 96, 101 Gentle wash in lukewarm water, do not bleach Full sleeve Round neck Package contains : 1 Set of top and 1 bottom pyjama"
    },
    {
        "itemName": "Raymond Fabrics Makers Men's Combo of Unstitched Poly Cotton Shirt and Trouser Fabric Set (Multicolour_Free Size)",
        "price": " 1225.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Easy Hand Wash Box Gift Packing II Original Raymond Makers Fabric Stylish Ready To Stitch Shirt And Trouser Fabric Set From The House Of Makers. Attractive Designs II Fabric : Synthetic Polyblend Viscose Included Components: 1 Shirt Piece + 1 Pant Piece Length: 1.20 Meter (Trouser) + 2.25 Meter (Shirt) Width : 150 Cm (Trouser) + 90 Cm (Shirt) Raymond Makers' Offers An Enticing Collection Of Packs That Make For Perfect Gifts. Celebrate Festivals, Special Occasions And Every Moments With The Gift Pack from Makers. Whether it's A Wedding Or A Birthday Party, There is A Stylish Gift Pre-packed By Makers.This is A Genuine Raymond Makers product. Raymond Unstitched Fabrics For Man And Boys ."
    },
    {
        "itemName": "Raymond Men's Polyester Unstitched Suit Fabric (Black, Free Size)",
        "price": " 1129.00",
        "status": "In stock.",
        "itemDescription": "MyFabricStore Exclusive Collection Raymond Poly-Viscose Suit Length - 3 meters Light Weight & Long Lasting Fabric Can Used as Formal and Semi-Casual Wear Good For Personal Use and Gifting"
    },
    {
        "itemName": "Dennis Lingo Men's Casual Shirt",
        "price": " 549.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Slim Fit Material: Cotton Slim fit Nehru/Mandarin collar Long sleeve Regular machine wash"
    },
    {
        "itemName": "ILU Cap for Men | Caps Baseball Snapback Beanie Sports Adjustable Hiphop Dancing Army Khaki",
        "price": " 349.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand Wash Only Designed For Maximum Comfort, the top level is here with the most classic and timeless plain \"NY\" cap that will provide you with both a low profile style and with impeccable quality Our caps present you with a simple style that you can wear casually on any occasion and under any circumstances Whether youâ??re a parent who needs a cap to casually walk around with your kids, or youâ??re an athlete who needs something comfortable to wear during their workout, our baseball caps are simply made for you Stay safe under the summer sun: Stop risking your health and safety by walking outdoors without adequate sun protection. Protect your skin from harmful UV rays and keep your hair out of your face and eyes by wearing this comfortable baseball cap during all your outdoor activities. Made of breathable, 100% high-quality cotton, it is the perfect companion for your active lifestyle Make an awesome gift: This baseball cap make an excellent present idea for your friends and loved ones. Great choice for regular daily use and outdoor activities especially like bushwalking, fishing, running, hitch-hike travel, baseball, cycling, golf, tennis, one size fits all design promises a secure and comfortable fit every time"
    },
    {
        "itemName": "Sticky Toffee Adjustable Face Cloth mask - 3 ply (Combo of 5) (Blue, Pink, Orange, Grey and Cream)",
        "price": " 330.00",
        "status": "In stock.",
        "itemDescription": "Lightweight, breathable and washable Anti-dust Widening thin elastic ear loops with adjuster (Fits everyone) Sterilized for use Material: 100% cotton"
    },
    {
        "itemName": "Linen Dzire Men's Linen Unstitched Shirt and Trouser Fabric Set (White , Free Size)",
        "price": " 1099.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Fabric : 100% Pure Denmark Linen Included Components: 1 Shirt Piece + 1 Pant Piece Length: 1.30 meter (Trouser) + 1.60 meter (Shirt) Width : 150 cm (Trouser) + 150 cm (Shirt) Colour :- Pure white colour ||Plain pattern || Pre-matched shirt and trouser fabric Linen Dzire Offers An Enticing Collection Of Packs That Make For Perfect Gifts."
    },
    {
        "itemName": "Raymond Men's Unstitched 1.3 m Trouser (Grey, Free Size)",
        "price": " 704.00",
        "status": "In stock.",
        "itemDescription": "Raymond Quality Name QUEST. Do not accept cheap products of other quality name Only buy from sellers with very high seller rating to get genuine products"
    },
    {
        "itemName": "Arvind Men's Cotton Solid Satin Unstitched 1.60m Shirt Fabric (White, Free Size)",
        "price": " 505.00",
        "status": "In stock.",
        "itemDescription": "Fit Type: Regular Fit Size :- 1.60 meter ( width :- 147 Cms) Arvind shirt fabric Material :- 100% premium cotton Can be machine washed / can be dry cleaned / use mild detergent / dry in shade Than cut :- premium quality fabric"
    },
    {
        "itemName": "Raymond Men's 3 m Unstitched Solid Suit Fabric (Brown, Free Size)",
        "price": " 1514.00",
        "status": "In stock.",
        "itemDescription": "Raymond Quality Name QUEST. Do not accept cheap products of other quality name Only buy from sellers with very high seller rating to get genuine products"
    },
    {
        "itemName": "Ben Martin Men's Relaxed Jeans",
        "price": " 696.00 - ₹ 698.00",
        "itemDescription": "Material: Cotton Color: Dark Blue Fit Type: Relaxed; Occasion: Casual Package Contents: 1 Jeans Wash Care Intructions: Do not bleach, dry in shade"
    },
    {
        "itemName": "SIMSCO Men's Polarized Aviator TAC Material Medium Size Square Wayfarer Sunglasses (SG-E001C-NP| Black, 30W x 34L)",
        "price": " 499.00",
        "status": "In stock.",
        "itemDescription": "Frame size: Lens width-59mm,nose-bridge; 15mm,temple length; 135mm"
    },
    {
        "itemName": "KUNDAN SULZ GWALIOR Men's Linen Blended Cotton Unstitched 1.60 m Shirt Fabric Piece (Maroon, Free Size)",
        "price": " 549.00",
        "status": "In stock.",
        "itemDescription": "Colour :- maroon, disclaimer :- product color may vary due to photographic lighting sources or your display settings Fabric :- cotton linen blended shirt pieces, pattern:- self, Exclusive Office Wear and Party Wear Length :- 1.60 meters ( 58\" ) shirt fabric sufficient to stitch s/ m /L/XL size full sleeves or 2XL size half sleeves shirt"
    },
    {
        "itemName": "Raymond Mens Combo Set Unstitched Shirt 2.25 Meters and Trouser Fabric 1.2 Meters - Gift Box Packing - F09",
        "price": " 999.00",
        "status": "Only 2 left in stock.",
        "itemDescription": "Raymond Pre-matched shirt and trouser Fabric. Same Color as shown in Image Ideal For Personal use as well as Gifting in Marriage, Festival and other Ocassions. Perfect for Special Occasions, Formal or Semi-Casual look. Cotton Polyster Blended Shirt Fabric - 2.25 M . Soft and Comfortable Polyblended Trouser Fabric (1.20 M) Fabric Care: Gentle machine wash, Do not bleach, Dry in shade, Medium to Hot Iron. Ideal for Gifting in Birthdays, Marriage, Anniversary, Diwali, Pongal, Ugadi, Eid, Graduation Gift, For Son, Father, Brother, Groom , Father in Law, Friends"
    },
    {
        "itemName": "Diverse Men's Cotton Cloth Face Mask (Pack of 3) (DCURM01FP03L34-66_White, Navy, Sky Blue_Free)",
        "price": " 279.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand Wash Fit Type: Regular The outer most layer is made up of 100% Cotton premium woven fabric,Innermost Layer (Single Knit Jersey) & Centre layer (3 Ply Polypropylene Spunbond Nonwoven) These masks come in a Pack of 3 Cloth masks only reduce the chances of inhaling dust/ droplets and they do not give full protection against infection. These need to be washed & cleaned each day and before first use. Face masks/ covers should not be shared and only one individual must use them as face cover. So, in a family of several members, each member should have a separate face cover. Completely Made in India Disclaimer: Product colour may slightly vary due to photographic lighting sources or your monitor settings"
    },
    {
        "itemName": "Raymond Men's Poly Blend Unstitched Shirt Piece (Blue, 2.4 Mtr, Free Size)",
        "price": " 569.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Raymond Sky Blue Poly Blend Unstitched Shirt Piece Poly Cotton Blend Semi-formals"
    },
    {
        "itemName": "Infant Yogi First Grade Cotton Langot Milky White Color,Best Abdomen Supporter",
        "price": " 499.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand Wash/Machine Wash Infant Yogi - Trusted Leading Brand in India - Made in Bharath Product The Best Abdomen Supporter. For Yoga,Gym,Wrestling,All Sports Activities 100% Pure Cotton Fabric. This Lankot made using Smooth & breathable Cotton. Long Lasting Quality Infant Yogi Langoti is made of good quality cotton to ensure comfort and the traditional design keeps the genitals secure Lankot ,a safe option for men while working out in the gym, indulging in games with physical exertion, carrying weight etc"
    },
    {
        "itemName": "Men's 100% Fine Cotton Shirt Fabric (Unstitched) - by Raymond",
        "price": " 583.00",
        "status": "In stock.",
        "itemDescription": "Fit Type: Regular Fit DE ETERNO by Raymond - by FCS Pure White PREMIUM QUALITY Fabric Choice of High Class 1.6 meters Unstitched Shirt Fabric 100% Cotton Shirt Fabric"
    },
    {
        "itemName": "Ramraj Men's Cotton Dhoti (2206BC_white_free size)",
        "price": " 315.00",
        "status": "In stock.",
        "itemDescription": "Bullion cotton dhoti .Material: Cotton, Color: Gold Color Border Length:2 mtrs Ideal for regular use Package Contents: 1 Piece Use only Hand wash"
    },
    {
        "itemName": "Qosha Men's Rayon Straight Fit Shirt",
        "price": " 649.00",
        "itemDescription": "Care Instructions: Hand Wash Only Fit Type: Regular Fit Fabric:Premium Rayon Cotton Fit Type: Regular Straight Fit Pattern: Stylish Digital Printed Casual & Party Wear Shirt Stylish Half Sleeve No Pocket Casual & Party Wear Shirt For Men Garment is made with relaxed Fit Fabric. The Product may cary from the images due to various reasons like monitor setting or photographic lighting sources or handiwork & craftmanship."
    },
    {
        "itemName": "EYEBOGLER Men's T-Shirt",
        "price": " 399.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Moisture wicking fabric is quick-drying, ultra-soft & has a soft feel, keeping you comfortable through any athletic activity. Designed for a comfortable experience. Crew-neck provides a nonrestrictive fit; short-sleeve allows for a wider range of motion Perfect for running, workout and training sports and even as an moisture wicking undershirt. Raglan sleeves for a sporty look Famously durable beefy-t fabric"
    },
    {
        "itemName": "Men's Shorts l Men's Bermuda Shorts l Men's Cotton Shorts (Pack of 2)",
        "price": " 399.00 - ₹ 499.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Relaxed Fit Length : Knee Legth Ocassion: You can use these shorts for Casual wears,Gym, Cricket, Football, Marshall Arts, Running, Cycling, Badminton and other Sporting activities Convenient 2 side pockets Encapsulated premium draw string fastener, front pocket ribbed welt for a sporty look Extra soft fabric for an enhanced touch and feel"
    },
    {
        "itemName": "Siyaram's Men's Poly Cotton Lining Shirt and Trouser (Mix Colour, Large)",
        "price": " 499.00",
        "status": "Only 5 left in stock.",
        "itemDescription": "Fit Type: Regular Fit It is made of Poly Cotton It is for men It is Mix in colour"
    },
    {
        "itemName": "MRD DESIGNER HUB Men's Running Shorts - Pack of 3 ( Black, Navy Blue, Royal Blue , Free Size)",
        "price": " 649.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Hand-wash, Machine-wash Fit Type: Athletic STYLISH SHORTS FOR MEN: Looking for shorts with extreme comfort and style. These Black , Navy Blue & Royal Blue semi-stretchable half pants are designed keeping the best fit and comfort in mind. MATERIAL : 100% Honeycomb, Machine wash cold. Spread the freedom-living lifestyle wearing shorts by MRD HUB. Made from Honeycomb Material, these shorts will keep you comfortable throughout. Featuring an attractive colour, these shorts will surely lend you a smart look."
    },
    {
        "itemName": "FINZ Trackpants Sports Wear for Men, Joggers for Men, Trackpant with 2 Side Zipper Pocket for Sports Gym Workout Running Yoga",
        "price": " 398.00 - ₹ 445.00",
        "itemDescription": "Care Instructions: Hand Wash Only Fit Type: Slim Fit MEN'S GYM SLIM FIT TRACKPANTS LOWER JOGGER - this trendy casual tracks for men is designed in a way that it is ideal for running, jogging, gym wear, yoga as the fabric fits perfectly to your body and stretches according to your moments MAN GENTS BOYS STRETCHABLE LOWER TRACK PANTS - Lycra absorbent sports wear track pants: this stylish gym & running wear pant is absorbent and made of lycra which makes it stretchable and gives you comfort and ease of movement MEN RUNNING GYM LOWER WITH 2 SIDE ZIP POCKETS - Deep pockets on both sides sweatpants- prevent your phone from falling out while exercising, running, jogging gymming sports cricket & everyday moments… PURELY MADE IN INDIA GYM RUNNING CRICKET YOGA WEAR - Perfect fit for gym, workout, running, jogging, bodybuilding cricket yoga hockey tennis hiking party rope skipping Lounge wear night wear sportswear Pajama pyjama and other outdoor activities TRACK PANTS FROM Finz : be it regular workouts at the gym or you want to step out for a coffee or dinner with friends in sporty style. These track pants for men with the logo will help you flaunt your unique style wherever you go"
    },
    {
        "itemName": "THE ARCHER Men's Slim Fit Joggers",
        "price": " 499.00",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Slim Fabric: 100% Cotton Style: Joggers ;Pattern: Graphic Print Rise: Mid Rise ;Closure: Drawstring ;Length: Full Length Occasion: Casual"
    },
    {
        "itemName": "KUNDAN SULZ GWALIOR Men's Linen and Cotton Unstitched 1.60 m Shirt Piece (Light Green, Free Size)",
        "price": " 599.00",
        "status": "In stock.",
        "itemDescription": "Colour :- mehandi green, disclaimer :- product color may vary due to photographic lighting sources or your display settings Fabric :- cotton linen blended shirt pieces, pattern:- self, Exclusive Office Wear and Party Wear Length :- 1.60 meters ( 58\" ) shirt fabric sufficient to stitch s/ m /L/XL size full sleeves or 2XL size half sleeves shirt"
    },
    {
        "itemName": "Amazon Brand - Symbol Men's Regular fit Polo",
        "price": " 469.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Color name: White&Maroon Material: Cotton Pattern: striped half sleeve machine wash"
    },
    {
        "itemName": "Raymond 0-Degree Men's Unstitiched Fabric Suiting for Pant or Coat or Suit",
        "price": " 2673.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Do not use direct hot iron, keep a cloth and then iron for long lasting Raymond Colorado (Quality Number) Suiting Branded Unstitched fabric which can be used to get Trouser or Coat or Suit stitched. Perfect for casual formal ethnic festive or wedding needs. Each clothing material made out of this luxurious cloth would create a royal look. 1.2 meter Length = Trouser for Waist Size till 32 inches, 1.3 meter Length = Trouser for Waist Size till 38 inches, 1.5 meter Length = Trouser for Waist Size aboce 38 inches, 2 meter Length = Coat for Standard Size Person, 2.6 meter Length = Safari Suit for height till 5 feet 8 inch, 3 meter Length = 2 Piece SUit for a standard size person, 3.5 meter Length = 3 piece Suit for a standard size person Breathable and Soft fabric which can keep you looking smart in cool winters or hot humid tropical summer weather. It has amazing ability to absorb sweat and yet keep looking smart and fresh and new. 0-Degree (Registered) branded wallet is perfect for classy usage with place for a 6 cards and a few notes. It is made enviornmentally sustainable non animal based material. Amazon Fulfilled product which you can buy with confidence and trust of Amazon backed quality check"
    },
    {
        "itemName": "Lyned Mens Cotton Half Sleeve Striped Polo T Shirt with Collar",
        "price": " 799.00",
        "status": "In stock.",
        "itemDescription": "Care Instructions: Machine Wash Fit Type: Regular Fit Fabric: 100% Pure Cotton ; Premium Export Quality Branded T-shirt ; Unique Collection to your wardrobe casuals a hit of effortless cool with this best looking t shirt. Comfort: Best Fashionably Comfortable Striped Trendy Premium Branded Polo T Shirts that you have worn till now. Occasion: Casual Office TShirt, Gifts, Get-together and Company Meet Ups Sleeve Type: Half Sleeve; Neck type: Collar Neck T-Shirt; Buttons: 3; Pocket: No Pockets; Stripe: Contrast Stripes; Style: Branded Polo T Shirt; Perfect for Trending Stylish Look for Company Outs as well. Perfect for Summer and Long life. Note: Check the Size chart to get Perfect fit for you! Shirt size 36 can go for S, 38 can go for M, 40 can go for L, 42 can go for XL. Quality: All garments are subjected to the following tests Fabric dimensional stability test and quality inspection for colours and wash fastness"
    }
]